app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(class_params(:tite, :room_number))
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Science"], ["room_number", 45], ["created_at", "2018-12-15 20:20:30.754842"], ["updated_at", "2018-12-15 20:20:30.754842"]]

  def update
    find_class
    @school_class.update(class_params(:title, :room_number))
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "not working"], ["room_number", 3], ["updated_at", "2018-12-17 17:03:21.240498"], ["id", 1]]

  def destroy
    find_class
    @school_class.destroy
---
DELETE FROM "school_classes" WHERE "school_classes"."id" = ?  [["id", 1]]

  def find_class
    @school_class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]