app/controllers/students_controller.rb

  def update
    # @student = Student.find(params[:id])
    @student.update(student_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-12-17 18:22:35.383814"], ["id", 1]]